tmp/wsl_ultra_retry_probe/wrk.txt
Running 8s test @ http://127.0.0.1:8083/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.59ms    3.63ms  68.76ms   82.25%
    Req/Sec    11.82k     1.76k   19.96k    72.97%
  Latency Distribution
     50%    5.26ms
     75%    7.16ms
     90%    8.98ms
     99%   15.85ms
  755580 requests in 8.06s, 108.08MB read
Requests/sec:  93798.16
Transfer/sec:     13.42MB